Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/test_app/firmware/src/packs/ATSAMA5D29_DFP/component/rtc.h
/*
 * Component description for RTC
 *
 * Copyright (c) 2024 Microchip Technology Inc. and its subsidiaries.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description file (ATDF) version 2024-06-24T14:43:55Z */
#ifndef _SAMA5D2_RTC_COMPONENT_H_
#define _SAMA5D2_RTC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR RTC                                          */
/* ************************************************************************** */

/* -------- RTC_TSTR : (RTC Offset: 0x00) ( R/ 32) TimeStamp Time Register 0 -------- */
#define RTC_TSTR_SEC_Pos                      _UINT32_(0)                                          /* (RTC_TSTR) Seconds of the Tamper Position */
#define RTC_TSTR_SEC_Msk                      (_UINT32_(0x7F) << RTC_TSTR_SEC_Pos)                 /* (RTC_TSTR) Seconds of the Tamper Mask */
#define RTC_TSTR_SEC(value)                   (RTC_TSTR_SEC_Msk & (_UINT32_(value) << RTC_TSTR_SEC_Pos)) /* Assigment of value for SEC in the RTC_TSTR register */
#define RTC_TSTR_MIN_Pos                      _UINT32_(8)                                          /* (RTC_TSTR) Minutes of the Tamper Position */
#define RTC_TSTR_MIN_Msk                      (_UINT32_(0x7F) << RTC_TSTR_MIN_Pos)                 /* (RTC_TSTR) Minutes of the Tamper Mask */
#define RTC_TSTR_MIN(value)                   (RTC_TSTR_MIN_Msk & (_UINT32_(value) << RTC_TSTR_MIN_Pos)) /* Assigment of value for MIN in the RTC_TSTR register */
#define RTC_TSTR_HOUR_Pos                     _UINT32_(16)                                         /* (RTC_TSTR) Hours of the Tamper Position */
#define RTC_TSTR_HOUR_Msk                     (_UINT32_(0x3F) << RTC_TSTR_HOUR_Pos)                /* (RTC_TSTR) Hours of the Tamper Mask */
#define RTC_TSTR_HOUR(value)                  (RTC_TSTR_HOUR_Msk & (_UINT32_(value) << RTC_TSTR_HOUR_Pos)) /* Assigment of value for HOUR in the RTC_TSTR register */
#define RTC_TSTR_AMPM_Pos                     _UINT32_(22)                                         /* (RTC_TSTR) AM/PM Indicator of the Tamper Position */
#define RTC_TSTR_AMPM_Msk                     (_UINT32_(0x1) << RTC_TSTR_AMPM_Pos)                 /* (RTC_TSTR) AM/PM Indicator of the Tamper Mask */
#define RTC_TSTR_AMPM(value)                  (RTC_TSTR_AMPM_Msk & (_UINT32_(value) << RTC_TSTR_AMPM_Pos)) /* Assigment of value for AMPM in the RTC_TSTR register */
#define RTC_TSTR_TEVCNT_Pos                   _UINT32_(24)                                         /* (RTC_TSTR) Tamper Events Counter Position */
#define RTC_TSTR_TEVCNT_Msk                   (_UINT32_(0xF) << RTC_TSTR_TEVCNT_Pos)               /* (RTC_TSTR) Tamper Events Counter Mask */
#define RTC_TSTR_TEVCNT(value)                (RTC_TSTR_TEVCNT_Msk & (_UINT32_(value) << RTC_TSTR_TEVCNT_Pos)) /* Assigment of value for TEVCNT in the RTC_TSTR register */
#define RTC_TSTR_BACKUP_Pos                   _UINT32_(31)                                         /* (RTC_TSTR) System Mode of the Tamper Position */
#define RTC_TSTR_BACKUP_Msk                   (_UINT32_(0x1) << RTC_TSTR_BACKUP_Pos)               /* (RTC_TSTR) System Mode of the Tamper Mask */
#define RTC_TSTR_BACKUP(value)                (RTC_TSTR_BACKUP_Msk & (_UINT32_(value) << RTC_TSTR_BACKUP_Pos)) /* Assigment of value for BACKUP in the RTC_TSTR register */
#define RTC_TSTR_Msk                          _UINT32_(0x8F7F7F7F)                                 /* (RTC_TSTR) Register Mask  */

/* UTC mode */
#define RTC_TSTR_UTC_Msk                      _UINT32_(0x00000000)                                  /* (RTC_TSTR_UTC) Register Mask  */


/* -------- RTC_TSDR : (RTC Offset: 0x04) ( R/ 32) TimeStamp Date Register 0 -------- */
#define RTC_TSDR_CENT_Pos                     _UINT32_(0)                                          /* (RTC_TSDR) Century of the Tamper Position */
#define RTC_TSDR_CENT_Msk                     (_UINT32_(0x7F) << RTC_TSDR_CENT_Pos)                /* (RTC_TSDR) Century of the Tamper Mask */
#define RTC_TSDR_CENT(value)                  (RTC_TSDR_CENT_Msk & (_UINT32_(value) << RTC_TSDR_CENT_Pos)) /* Assigment of value for CENT in the RTC_TSDR register */
#define RTC_TSDR_YEAR_Pos                     _UINT32_(8)                                          /* (RTC_TSDR) Year of the Tamper Position */
#define RTC_TSDR_YEAR_Msk                     (_UINT32_(0xFF) << RTC_TSDR_YEAR_Pos)                /* (RTC_TSDR) Year of the Tamper Mask */
#define RTC_TSDR_YEAR(value)                  (RTC_TSDR_YEAR_Msk & (_UINT32_(value) << RTC_TSDR_YEAR_Pos)) /* Assigment of value for YEAR in the RTC_TSDR register */
#define RTC_TSDR_MONTH_Pos                    _UINT32_(16)                                         /* (RTC_TSDR) Month of the Tamper Position */
#define RTC_TSDR_MONTH_Msk                    (_UINT32_(0x1F) << RTC_TSDR_MONTH_Pos)               /* (RTC_TSDR) Month of the Tamper Mask */
#define RTC_TSDR_MONTH(value)                 (RTC_TSDR_MONTH_Msk & (_UINT32_(value) << RTC_TSDR_MONTH_Pos)) /* Assigment of value for MONTH in the RTC_TSDR register */
#define RTC_TSDR_DAY_Pos                      _UINT32_(21)                                         /* (RTC_TSDR) Day of the Tamper Position */
#define RTC_TSDR_DAY_Msk                      (_UINT32_(0x7) << RTC_TSDR_DAY_Pos)                  /* (RTC_TSDR) Day of the Tamper Mask */
#define RTC_TSDR_DAY(value)                   (RTC_TSDR_DAY_Msk & (_UINT32_(value) << RTC_TSDR_DAY_Pos)) /* Assigment of value for DAY in the RTC_TSDR register */
#define RTC_TSDR_DATE_Pos                     _UINT32_(24)                                         /* (RTC_TSDR) Date of the Tamper Position */
#define RTC_TSDR_DATE_Msk                     (_UINT32_(0x3F) << RTC_TSDR_DATE_Pos)                /* (RTC_TSDR) Date of the Tamper Mask */
#define RTC_TSDR_DATE(value)                  (RTC_TSDR_DATE_Msk & (_UINT32_(value) << RTC_TSDR_DATE_Pos)) /* Assigment of value for DATE in the RTC_TSDR register */
#define RTC_TSDR_Msk                          _UINT32_(0x3FFFFF7F)                                 /* (RTC_TSDR) Register Mask  */

/* UTC mode */
#define RTC_TSDR_UTC_Msk                      _UINT32_(0x00000000)                                  /* (RTC_TSDR_UTC) Register Mask  */


